# First print your name in the cell below then save this file. (or something nice about your instructor)

In [41]:
# In this cell print your name 
print("My name is Fei")
print("Geo is a great TA")

My name is Fei
Geo is a great TA

# Data wrangling with Pandas exercise
* For this exercise we will be using the `listings.csv` data file.

In [2]:
import pandas as pd
import numpy as np

# Load in the data file using `pd.read_csv()`

In [39]:
# Load data here
df = pd.read_csv("/Users/ceo/Desktop/CTP_DATASCI_FRIDAY/my-fork-2024-fall-data-science/Week-01-Pandas/data/listings.csv")
df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,175,3,48,2019-11-04,0.37,2,365
1,3831,"Whole flr w/private bdrm, bath & kitchen(pls r...",4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,75,1,340,2020-08-01,4.75,1,265
2,5121,BlissArtsSpace!,7356,Garon,Brooklyn,Bedford-Stuyvesant,40.68688,-73.95596,Private room,60,29,50,2019-12-02,0.37,1,365
3,5136,"Spacious Brooklyn Duplex, Patio + Garden",7378,Rebecca,Brooklyn,Sunset Park,40.66120,-73.99423,Entire home/apt,175,14,1,2014-01-02,0.01,1,295
4,5178,Large Furnished Room Near B'way,8967,Shunichi,Manhattan,Hell's Kitchen,40.76489,-73.98493,Private room,65,2,473,2020-03-15,3.44,1,340

## Exercise 2 - Filtering

Return the following subsets of the dataframe.

1. How many listings are there with a price less than 100? 


2. Find how many listings there are in just Brooklyn.


3. Find how many listings there are in Brooklyn with a price less than 100.


4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.


5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  The prices for all other listings should be the same as the were before. 


6. What % of the rooms are private, and what % of the rooms are shared.  
    * Hint, use `.value_counts()`

In [49]:
# 1. How many listings are there with a price less than 100? 
df[df['price'] < 100].shape[0]

22778

In [58]:
# 2. Make a new DataFrame of listings in Brooklyn named `df_bk` 
# and find how many listings in just Brooklyn.
df["df_bk"] = (df['neighbourhood'] == 'Brooklyn')
df['df_bk'].shape[0]

46527

In [57]:
# 3. Find how many listings there are in Brooklyn with a price less than 100.
df[(df['neighbourhood'] == 'Brooklyn') & (df['price'] < 100)].shape[0]

0

In [75]:
# 4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.
# How many total are there that have those names
names = ['Michael','David','John','Daniel']
df[df['host_name'].isin(names)].shape[0]

1258

In [144]:
# 5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  
# The prices for all other listings should be the same as the were before. 
df['adjusted_price'] = df['price']
df.loc[df['neighbourhood'] == 'Williamsburg', 'adjusted_price'] += 100
df[df['neighbourhood'] == 'Williamsburg'][['price','adjusted_price']]

       price  adjusted_price
11       109             209
15       299             399
35       131             231
38       175             275
42        80             180
...      ...             ...
46484    250             350
46489    464             564
46493    100             200
46513    180             280
46517     55             155

[3486 rows x 2 columns]

In [123]:
# 6. What % of the rooms are private, and what % of the rooms are shared.  
df.columns
private_room_percent = df[(df['room_type'] == 'Private room')].shape[0] / len(df) * 100
shared_room_percent = df[(df['room_type'] == 'Shared room')].shape[0] / len(df) * 100
private_room_result = round(private_room_percent, 2)
shared_room_result = round(shared_room_percent, 2)
print(f"{private_room_result}%")
print(f"{shared_room_result}%")

45.44%
2.12%

# Exercise 3 - Grouping

1. Using `groupby`, count how many listings are in each neighbourhood_group.


2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 


3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 


4. Using `groupby`, find the median price for each room type in each neighbourhood_group.


5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices for each room type in each neighbourhood_group.

In [151]:
# 1. Using `groupby`, count how many listings are in each neighbourhood_group.
len(df.groupby('neighbourhood_group'))

5

In [158]:
# 2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 
df.groupby('neighbourhood_group')['price'].mean()

neighbourhood_group
Bronx             92.751479
Brooklyn         120.225258
Manhattan        191.880466
Queens            99.754965
Staten Island    110.947214
Name: price, dtype: float64

In [159]:
# 2.5. Using `groupby`, find the mean price for each room_type. 
df.groupby('room_type')['price'].mean()

room_type
Entire home/apt    199.395950
Hotel room         275.015075
Private room        91.453084
Shared room         87.063830
Name: price, dtype: float64

In [164]:
# 3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 
df.groupby('neighbourhood_group')['price'].agg(['min','max'])

                     min    max
neighbourhood_group
Bronx                 16   1404
Brooklyn               0  10000
Manhattan              0  10000
Queens                 0  10000
Staten Island         19   1200

In [165]:
# 4. Using `groupby`, find the mean price for each room_type in each neighbourhood_group.
df.groupby('room_type')['price'].mean()

room_type
Entire home/apt    199.395950
Hotel room         275.015075
Private room        91.453084
Shared room         87.063830
Name: price, dtype: float64

In [166]:
# 5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices 
# for each room type in each neighbourhood_group.
df.groupby('neighbourhood_group')['price'].agg(['count','min','max','sum'])

                     count  min    max      sum
neighbourhood_group
Bronx                 1183   16   1404   109725
Brooklyn             18632    0  10000  2240037
Manhattan            20580    0  10000  3948900
Queens                5791    0  10000   577681
Staten Island          341   19   1200    37833

# Load, Merge, and Export files.
1. Load the `prices.csv` and the `n_listings.csv`
    * Having an error..? Inspect the actual csv file if you're having trouble

2. Do join that keeps all the records for each table.
    * Neighbourhood groups should include ['Bronx', 'Brooklyn', 'Manhattan', 'Queens', 'Staten Island',
       'LongIsland']

       
3. Save your joined csv as `joined.csv` into the data folder. 


4. Load your saved table and see if it looks the same or different that the DataFrame you used to create it.

In [194]:
# 1. Load the `prices.csv` and the `n_listings.csv`
df_2 = pd.read_csv('/Users/ceo/Desktop/CTP_DATASCI_FRIDAY/my-fork-2024-fall-data-science/Week-01-Pandas/data/prices.csv')
df_3 = pd.read_csv('/Users/ceo/Desktop/CTP_DATASCI_FRIDAY/my-fork-2024-fall-data-science/Week-01-Pandas/data/n_listings.csv', sep=';')

  neighbourhood_group   mean_price  n_listings
0               Bronx    92.751479        1183
1            Brooklyn   120.225258       18632
2           Manhattan   191.880466       20580

In [196]:
# 2. Do join that keeps all the records for each table.


joined_df = pd.merge(df_2, df_3, on="neighbourhood_group")
print(joined_df)

  neighbourhood_group   mean_price  n_listings
0               Bronx    92.751479        1183
1            Brooklyn   120.225258       18632
2           Manhattan   191.880466       20580

In [197]:
# 3. Save your joined csv as `joined.csv` into the data folder. 
joined_df.to_csv('/Users/ceo/Desktop/CTP_DATASCI_FRIDAY/my-fork-2024-fall-data-science/Week-01-Pandas/data/joined.csv', sep="\t", index=False)

In [195]:
# 4. Load your newly saved file, see if it looks the same.  If not, try saving with argument `index=False`
joined_df

  neighbourhood_group   mean_price  n_listings
0               Bronx    92.751479        1183
1            Brooklyn   120.225258       18632
2           Manhattan   191.880466       20580

# Extra Credit
Every question below this cell is extra credit and optional.

### 1. (Easy) Explore this new PandasAI Package and tell me what its all about because I've never used it. 
* https://www.youtube.com/watch?v=5w6eZaoDVVk&ab_channel=CodingIsFun  
* See if you can use it on the listings.csv to find out some cool info. or answer some of the questions above.

### 2. (Very Easy) Find other cool Panda packages / add ons and show us what they can do well. And how you installed them.

### (Extra Hard) Download the files for the past 5 years into a new folder and add them all into one data frame using pandas, then save that new file.
* Try to not hard code in the file names. We want to do this programmatically because what if we want to add new/more file names in the future.